---
kind: type
id: T:Autodesk.Revit.DB.Visual.Generic
source: html/dd16eb59-16ec-f121-289b-a69d26d7c789.htm
---
# Autodesk.Revit.DB.Visual.Generic

A static class that provides access to the property names that appear in the Generic visual asset schema.

## Syntax (C#)
```csharp
public static class Generic
```